{
  "current": "1.2.3",
  "releaseDate": "2026-02-09",
  "versions": [
    {
      "version": "1.2.3",
      "date": "2026-02-09",
      "title": "Implementação de novas funcionalidades.",
      "type": "update",
      "changes": {
        "improved": [
          "Implementação do fechamento automático de tickets quando o usuário não responde por mais de 72 horas.",
          "Adicionado o status \"encerrado\" para tickets que foram encerrados sem resolução efetiva"
        ],
        "fixed": [
          "Correção da busca pelas categorias no banco de dados que estavam limitadas a 50, causando erro em telas que exibiam mais de 50 categorias.",
          "Correção do erro 400 que era ebixido ao tentar inserir uma configuração de SLA que já existia.",
          "Correção do modal de categorias que ficava cortado ao exibir o limite da tela."
        ]
      }
    },
    {
      "version": "1.2.2",
      "date": "2026-02-04",
      "title": "Correção de bugs.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção de filtros no sistema de notificações."
        ]
      }
    },
    {
      "version": "1.2.1",
      "date": "2026-01-22",
      "title": "Implementação de novas funcionalidades.",
      "type": "update",
      "changes": {
        "improved": [
          "Implementada a seleção de multiplos status no filtro do relatório de chamados."
        ],
        "fixed": [
          "Desabilitado o botão de gerar termo de resposabilidade quando o termo já foi assinado.",
          "Correções menores de bugs."
        ]
      }
    },
    {
      "version": "1.2.0",
      "date": "2025-12-15",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Nova estrutura de notificações no sistema, tornando o sistema mais interativo e moderno.",
          "Implementação de nova tela de inventário de equipamentos, com funcionalidades de movimentação de equipamentos entre estoques."
        ]
      }
    },
    {
      "version": "1.1.2",
      "date": "2025-12-02",
      "title": "Implementação de novas funcionalidades.",
      "type": "update",
      "changes": {
        "improved": [
          "Implementação dos filtros de tipos de chamados e categorias na tela de tickets."
        ],
        "fixed": [
          "Correção nas cores de algumas funcionalidades nos temas personalizados."
        ]
      }
    },
    {
      "version": "1.1.1",
      "date": "2025-11-13",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Implementação do filtro de categorias no dashboard.",
          "Criação da função de prestadores de serviços, utilizados para atribuir prestadores de serviços aos tickets.",
          "Implementação do PWA, transformando o sistema em uma aplicação web progressiva (PWA) instalável em Android e iOS."
        ],
        "fixed": [
          "Correção da função de exportação dos relatórios para Excel.",
          "Melhorias de performance na tela de Dashboard de SLA",
          "Correção na transferência de tickets entre departamentos que não exibia as categorias.",
          "Correção das variáveis de tradução na tela de pesquisa de satisfação.",
          "Correção na tela de configurações quando não tem permissão de acesso as configurações de IA."
        ]
      }
    },
    {
      "version": "1.1.0",
      "date": "2025-10-20",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Tradução do sistema para o inglês, reconhecendo a lingagem do navegador.",
          "Implementação do tema escuro no sistema (não válido para empresas com temas personalizados).",
          "Implementação do filtro de Tipo de Chamado no dashboard.",
          "Implementação do botão de excluir arquivos anexados enquanto o ticket ainda não foi enviado.",
          "Modal de pesquisa de satisfacao exibido apos o login, evitando duplicidade por chamado e mostrando o titulo do ticket."
        ],
        "fixed": [
          "Correção do dashboard de satisfação, que agora exibe corretamente as pesquisas expiradas.",
          "Correção do modal de Análise de IA na criação de novos tickets.",
          "Correções menores no sistema."
        ]
      }
    },
    {
      "version": "1.0.32",
      "date": "2025-09-29",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Implementação do relatório de performance."
        ]
      }
    },
    {
      "version": "1.0.31",
      "date": "2025-09-23",
      "title": "Correções de bugs.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção na extração de prioridade da IA.",
          "Correção no botão de avaliar atendimento.",
          "Correção na tela de avaliação de atendimento que podia não carregar o tema de cores.",
          "Correção na codificação dos e-mails que podia causar erros na exibição no Outlook ou Gmail.",
          "Adicionados comentários obrigatórios na avaliação de atendimento quando avaliado com 1 ou 2 estrelas.",
          "Correção do checkbox de alterar senha no próximo login na tela de clientes que não estava sendo enviado para o backend."
        ]
      }
    },
    {
      "version": "1.0.30",
      "date": "2025-09-18",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Implementação da pesquisa de satisfação automática."
        ],
        "improved": [
          "Melhoria no dashboard inicial com indicadores de evolução."
        ]
      }
    },    
    {
      "version": "1.0.29",
      "date": "2025-09-15",
      "title": "Melhorias no sistema",
      "type": "update",
      "changes": {
        "improved": [
          "Implementação de filtro de departamentos no dashboard."
        ]
      }
    },    
    {
      "version": "1.0.28",
      "date": "2025-09-12",
      "title": "Correções de bugs",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Corrigido os dropdowns de departamentos, prioridades e status na tela de relatório de chamados.",
          "Modernização dos gráficos do dashboard."
        ]
      }
    },    
    {
      "version": "1.0.27",
      "date": "2025-09-09",
      "title": "Correções de bugs",
      "type": "feature",
      "changes": {
        "new": [
          "Implmentação de funcionalidade para transferência de tickets entre departamentos."
        ],
        "fixed": [
          "Corrigido o campo de Tipo de Chamado duplicado na tela de resposta de tickets."
        ]
      }
    },
    {
      "version": "1.0.25",
      "date": "2025-08-25",
      "title": "Correções de bugs",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção para gerentes visualizarem os tickets apenas dos departamentos que estão vinculados.",
          "Correção na tela de adicionar SLA, organizando os dropdowns em ordem alfabética.",
          "Correção na tela de adicionar SLA para não exibir departamentos, tipos de chamados ou categorias inativos.",
          "Tela de resposta de tickets agora exibe as transferências de atendentes.",
          "Tela de detalhamento de tickets agora exibe a categoria do chamado.",
          "Correção do filtro de departamentos no relatório de chamados."
        ]
      }
    },
    {
      "version": "1.0.24",
      "date": "2025-08-15",
      "title": "Correções críticas em permissões de atendentes.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção de vazamento de tickets.",
          "Correção ao criar/vincular atendentes (erros 409/500).",
          "Correção no dropdown de atendentes na tela de resposta de tickets organizando alfabeticamente e filtrando inativos."
        ],
        "improved": [
          "Logs e mensagens de diagnóstico mais claras em casos de departamentos não encontrados."
        ]
      }
    },
    {
      "version": "1.0.23",
      "date": "2025-07-25",
      "title": "Análise de Reabertura de Chamados por IA.",
      "type": "feature",
      "changes": {
        "new": [
          "Implementação de análise de reabertura de chamados por IA.",
          "Dashboard de autoridade das análises de IA (prioridade e reabertura).",
          "Exibição das análises de IA na tela de detalhamento do chamado para atendentes e clientes."
        ],
        "improved": [
          "Melhor acompanhamento das análises de IA por parte dos usuários.",
          "Interface aprimorada para visualização das análises de prioridade e reabertura."
        ]
      }
    },
    {
      "version": "1.0.22",
      "date": "2025-07-20",
      "title": "Correções de bugs.",
      "type": "update",
      "changes": {
        "improved": [
          "Implementada função de adicionar participantes do ticket.",
          "Melhorias nos layouts dos e-mails de notificação de chamados."
        ],
        "fixed": [
          "Ajustes nas notificações de chamados por e-mail.",
          "Ajustes na lentidão no envio das respostas dos chamados.",
          "Correção nas notificações de atendentes vinculados aos chamados.",
          "Alterado o período padrão dos filtros de datas para o mês atual nas telas de tickets e dashboard.",
          "Correção nos envios de arquivos para o S3.",
          "Correção em permissões nas telas de tickets e respostas."
        ]
      }
    },
    {
      "version": "1.0.21",
      "date": "2025-07-18",
      "title": "Correções de bugs.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção no filtro de atendentes na tela de tickets."
        ]
      }
    },
    {
      "version": "1.0.20",
      "date": "2025-07-16",
      "title": "Mehorias de performance e correções de bugs.",
      "type": "update",
      "changes": {
        "improved": [
          "Melhoria de performance na tela de tickets.",
          "Melhoria de performance na tela de atendentes.",
          "Melhoria de performance na tela de clientes.",
          "Melhoria de performance na tela de tipos de chamado.",
          "Melhoria de performance na tela de categorias.",
          "Melhoria de performance na tela de SLA.",
          "Melhoria de performance na tela de dashboard.",
          "Melhoria de performance na tela de notificações.",
          "Adição de novos formatos de arquivos para anexos de chamados."
        ],
        "fixed": [
          "Correção de permissão nas respostas de tickets.",
          "Correção de envio de e-mails de notificação de chamados para atendentes de outros departamentos.",
          "Acerto dos cálculos de SLA na tela inicial (dashboard) para seguir as regras de SLA.",
          "Aceerto dos cálculos de SLA no dashboard para seguir as regras de SLA.",
          "Acerto dos filtros de tickets para clientes, exibindo apenas os próprios chamados.",
          "Melhorias nas estatísticas de performance.",
          "Checkbox de ocultar tickets resolvidos fica fixo na tela de tickets."
        ]
      }
    },
    {
      "version": "1.0.19",
      "date": "2025-07-08",
      "title": "Implementação de novas funcionalidades.",
      "type": "update",
      "changes": {
        "new": [
          "Implementação do filtro de chamados com status diferente de resolvido."
        ],
        "fixed": [
          "Ajuste clientes pela ordem alfabética na tela de clientes.",
          "Ajuste dos atendentes pela ordem alfabética na tela de atendentes."
        ]
      }
    },
    {
      "version": "1.0.18",
      "date": "2025-07-04",
      "title": "Implementação de novas funcionalidades.",
      "type": "feature",
      "changes": {
        "new": [
          "Implementação da tela de prioridades, adicionando prioridades personalizadas por departamento.",
          "Implementação de tela de categorias, adicionando categorias personalizadas por tipo de chamado.",
          "Implementação de novo sistema de SLA, adicionando SLA personalizado por departamento.",
          "Implementação de tela com dashboard de SLA, mostrando o SLA de cada departamento.",
          "Implementação de análise de prioridade pela IA por departamento, usando prompts personalizados para cada departamento.",
          "Adicionado novo widget com a quantidade de chamados outros status, ajustando a conta de total de chamados."
        ],
        "fixed": [
          "Ajuste do dashboard corrigindo o widget de chamados por prioridade, puxando o novo padrão implementado.",
          "Melhorias de layout nos badges de edição/atualização.",
          "Ajustes na tela de cadastro de IA.",
          "Ajuste no badge de atendentes, vinculando o cadastro do usuário que já existe ao atendente que está sendo cadastrado.",
          "Ajuste na tela de tickets para não puxar departamentos, tipos de chamados e categorias inativas.",
          "Corrigido erro no badge de editar/atualizar categorias.",
          "Corrigido filtro de atendentes na vinculação dos tickets para puxar apenas atendentes do departamento vinculado ao ticket.",
          "Corrigido erro nas variáveis de e-mail para envio de e-mails de notificação de chamados.",
          "Ajustado a ordem dos tickets na tela de tickets, puxando os mais recentes primeiro.",
          "Ajuste nos dropdowns de atendentes para exibir em ordem alfabética.",
          "Ajuste na conexão do websocket.",
          "Acerto do cálculo do SLA no início do atendimento."
        ]
      }
    },
    {
      "version": "1.0.17",
      "date": "2025-06-23",
      "title": "Implementação de novas funcionalidades.",
      "type": "update",
      "changes": {
        "new": [
          "Implementação de filtro de atendentes no dashboard.",
          "Implementação de widgets de tempo médio de primeiro atendimento e tempo médio de resolução de chamados.",
          "Implantação do filtro de datas no dashboard."
        ],
        "fixed": [
          "Ajuste no cálculo do SLA, descontando o período em que o ticket estava pendente."
        ]
      }
    },
    {
      "version": "1.0.16",
      "date": "2025-06-16",
      "title": "Correções de bugs.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção da conexão com o websocket usando nginx.",
          "Correção do histórico de chamados exibindo as alterações de prioridade alteradas pela IA.",
          "Correção na análise de prioridade pela IA."
        ]
      }
    },
    {
      "version": "1.0.15",
      "date": "2025-06-12",
      "title": "Adição de novas funcionalidades.",
      "type": "update",
      "changes": {
        "new": [
          "Implementação de novas funcionalidades de gerenciamento de chamados."
        ],
        "fixed": [
          "Correção no filtro de datas na tela de chamados."
        ]
      }
    },
    {
      "version": "1.0.14",
      "date": "2025-06-12",
      "title": "Melhorias de Performance e Usabilidade.",
      "type": "update",
      "changes": {
        "new": [
          "Sistema de notificações em tempo real mais rápido.",
          "Interface do dashboard otimizada para carregamento mais ágil.",
          "Filtros avançados na lista de chamados.",
          "Melhoria na busca de chamados por texto."
        ],
        "improved": [
          "Tempo de resposta do sistema reduzido em até 75%.",
          "Carregamento de páginas mais rápido.",
          "Interface mais responsiva em dispositivos móveis.",
          "Estabilidade geral do sistema aprimorada."
        ],
        "fixed": [
          "Correção de problemas de sincronização em tempo real.",
          "Resolução de lentidão em listas com muitos registros.",
          "Correção de bugs na exibição de gráficos do dashboard.",
          "Melhoria na precisão dos filtros de data."
        ]
      }
    },
    {
      "version": "1.0.13",
      "date": "2025-06-08",
      "title": "Gestão de Empresas Aprimorada.",
      "type": "feature",
      "changes": {
        "new": [
          "Visualização de empresa associada a cada usuário.",
          "Melhor organização multi-empresa.",
          "Filtros por empresa para administradores."
        ],
        "improved": [
          "Interface de gerenciamento de usuários mais clara.",
          "Identificação visual de usuários globais vs empresariais."
        ]
      }
    },
    {
      "version": "1.0.12",
      "date": "2025-06-03",
      "title": "Sistema de Tipos de Chamado.",
      "type": "feature",
      "changes": {
        "new": [
          "Gestão completa de tipos de chamado.",
          "Ativação/desativação de tipos específicos.",
          "Categorização por departamentos.",
          "Descrições detalhadas para cada tipo."
        ],
        "improved": [
          "Processo de abertura de chamados mais organizado.",
          "Melhor direcionamento para equipes especializadas."
        ]
      }
    },
    {
      "version": "1.0.11",
      "date": "2025-05-28",
      "title": "Departamentos e Organização.",
      "type": "feature",
      "changes": {
        "new": [
          "Sistema completo de departamentos.",
          "Atribuição automática por especialidade.",
          "Configuração flexível de estrutura organizacional."
        ],
        "improved": [
          "Roteamento inteligente de chamados.",
          "Visibilidade clara de responsabilidades."
        ]
      }
    },
    {
      "version": "1.0.10",
      "date": "2025-05-22",
      "title": "Comunicação e Histórico.",
      "type": "feature",
      "changes": {
        "new": [
          "Sistema de respostas aprimorado.",
          "Histórico completo de interações.",
          "Notificações de novas mensagens.",
          "Anexos em chamados e respostas."
        ],
        "improved": [
          "Interface de comunicação mais intuitiva.",
          "Melhor organização do histórico de chamados."
        ]
      }
    },
    {
      "version": "1.0.9",
      "date": "2025-05-15",
      "title": "Dashboard e Métricas.",
      "type": "feature",
      "changes": {
        "new": [
          "Dashboard completo com gráficos.",
          "Métricas por status e prioridade.",
          "Visão geral de chamados recentes.",
          "Indicadores de performance."
        ],
        "improved": [
          "Visualização mais clara dos dados.",
          "Gráficos interativos e informativos."
        ]
      }
    },
    {
      "version": "1.0.8",
      "date": "2025-05-08",
      "title": "Sistema de Prioridades.",
      "type": "feature",
      "changes": {
        "new": [
          "Níveis de prioridade: Baixa, Média, Alta, Crítica.",
          "Indicadores visuais por prioridade.",
          "Ordenação automática por urgência."
        ],
        "improved": [
          "Melhor gestão de urgências.",
          "Priorização inteligente de atendimentos."
        ]
      }
    },
    {
      "version": "1.0.7",
      "date": "2025-05-01",
      "title": "Gestão de Status.",
      "type": "feature",
      "changes": {
        "new": [
          "Status Novo, Em Andamento e Resolvido.",
          "Transições automáticas de status.",
          "Histórico de mudanças de status."
        ],
        "improved": [
          "Acompanhamento mais claro do progresso.",
          "Transparência no fluxo de atendimento."
        ]
      }
    },
    {
      "version": "1.0.6",
      "date": "2025-04-25",
      "title": "Notificações em Tempo Real.",
      "type": "feature",
      "changes": {
        "new": [
          "Notificações instantâneas para novos chamados.",
          "Avisos de mudanças de status.",
          "Alertas de novas respostas."
        ],
        "improved": [
          "Comunicação mais ágil entre usuários e equipe.",
          "Redução no tempo de resposta."
        ]
      }
    },
    {
      "version": "1.0.5",
      "date": "2025-04-20",
      "title": "Gestão de Usuários.",
      "type": "feature",
      "changes": {
        "new": [
          "Perfis de usuário personalizáveis.",
          "Configurações individuais.",
          "Gerenciamento de informações pessoais."
        ],
        "improved": [
          "Experiência personalizada para cada usuário.",
          "Melhor controle de dados pessoais."
        ]
      }
    },
    {
      "version": "1.0.4",
      "date": "2025-04-16",
      "title": "Sistema de Filtros.",
      "type": "feature",
      "changes": {
        "new": [
          "Filtros por status, prioridade e data.",
          "Busca avançada por título e descrição.",
          "Filtros salvos para consultas frequentes."
        ],
        "improved": [
          "Localização mais rápida de chamados específicos.",
          "Melhor organização da lista de chamados."
        ]
      }
    },
    {
      "version": "1.0.3",
      "date": "2025-04-12",
      "title": "Interface Responsiva.",
      "type": "improvement",
      "changes": {
        "improved": [
          "Otimização para dispositivos móveis.",
          "Interface adaptável a diferentes tamanhos de tela.",
          "Melhor experiência em tablets e smartphones."
        ],
        "fixed": [
          "Correção de problemas de layout em telas pequenas.",
          "Ajustes na navegação móvel."
        ]
      }
    },
    {
      "version": "1.0.2",
      "date": "2025-04-08",
      "title": "Correções de Estabilidade.",
      "type": "bugfix",
      "changes": {
        "fixed": [
          "Correção de erros na criação de chamados.",
          "Resolução de problemas de carregamento.",
          "Melhoria na estabilidade da conexão.",
          "Correção de bugs na exibição de dados."
        ],
        "improved": [
          "Performance geral do sistema.",
          "Confiabilidade das operações."
        ]
      }
    },
    {
      "version": "1.0.1",
      "date": "2025-04-05",
      "title": "Primeiras Melhorias.",
      "type": "improvement",
      "changes": {
        "improved": [
          "Interface de usuário mais intuitiva.",
          "Melhorias na usabilidade geral.",
          "Otimizações de performance."
        ],
        "fixed": [
          "Correções menores de interface.",
          "Ajustes na responsividade."
        ]
      }
    },
    {
      "version": "1.0.0",
      "date": "2025-04-01",
      "title": "Lançamento Inicial.",
      "type": "major",
      "changes": {
        "new": [
          "Sistema completo de gestão de chamados.",
          "Abertura e acompanhamento de solicitações.",
          "Dashboard com visão geral.",
          "Sistema de autenticação seguro.",
          "Gestão de clientes e atendentes.",
          "Comunicação entre usuários e suporte."
        ]
      }
    }
  ],
  "metadata": {
    "name": "Sistema de Gestão de Chamados.",
    "codename": "Ticket Wise.",
    "environment": "production.",
    "lastUpdate": "2025-06-12T10:30:00Z"
  }
} 
